{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.3.1", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of10.bin", "group1-shard2of10.bin", "group1-shard3of10.bin", "group1-shard4of10.bin", "group1-shard5of10.bin", "group1-shard6of10.bin", "group1-shard7of10.bin", "group1-shard8of10.bin", "group1-shard9of10.bin", "group1-shard10of10.bin"], "weights": [{"name": "embedding/embeddings", "shape": [3123, 512], "dtype": "float32"}, {"name": "gru/kernel", "shape": [512, 3072], "dtype": "float32"}, {"name": "gru/recurrent_kernel", "shape": [1024, 3072], "dtype": "float32"}, {"name": "gru/bias", "shape": [3072], "dtype": "float32"}, {"name": "dense/kernel", "shape": [1024, 3123], "dtype": "float32"}, {"name": "dense/bias", "shape": [3123], "dtype": "float32"}]}]}